БИТУправление_медицинским_центром_демо/src/Catalogs/ДействияМедосмотра/ДействияМедосмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДействияМедосмотра</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыДействийМедицинскогоОсмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеДействия</name>
    <type>
      <types>CatalogRef.ОграниченияДействийМедосмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьВПрограммеПрохождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Врач</name>
    <type>
      <types>CatalogRef.ДействияМедосмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляОтметкиИсследования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКабинетаДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗаключенияПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсследования</name>
    <type>
      <types>EnumRef.ВидыИсследованийДействийМедосмотра</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ПереченьВредныхФакторовИРабот/ПереченьВредныхФакторовИРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПереченьВредныхФакторовИРабот</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ОбязательныеДействия29н</name>
      <description>Обязательные действия 29н</description>
    </items>
    <items>
      <name>ОбязательныеДействия302н</name>
      <description>Обязательные действия 302н</description>
    </items>
    <items>
      <name>ОбязательныеДействия342н</name>
      <description>Обязательные действия 342н</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеречняДляМедОсмотра</name>
    <type>
      <types>EnumRef.ВидыПеречняДляМедОсмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерППДляСортировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрачиСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛабораторныеИФункциональныеИсследованияСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскиеПротивопоказанияСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскиеПротивопоказанияСтрокаДляЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОсмотров</name>
    <type>
      <types>CatalogRef.ПериодичностьОсмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВредноеВещество</name>
    <type>
      <types>CatalogRef.ВредныеВещества</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерППиПриказа_302н</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерПП_302н</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерППДляСортировки_302н</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приказ</name>
    <type>
      <types>CatalogRef.ПриказыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОсмотраСправки</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Врачи</name>
    <attributes>
      <name>Врач</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоРекомендации</name>
      <comment>По показаниям врачей-специалистов</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМедосмотра</name>
      <type>
        <types>EnumRef.ТипыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>Ограничение</name>
      <type>
        <types>CatalogRef.ОграниченияДействийМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриРасчетеЦены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеТребуетОтметкиВыполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛабораторныеИФункциональныеИсследования</name>
    <attributes>
      <name>Исследование</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоРекомендации</name>
      <comment>По показаниям врачей-специалистов</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМедосмотра</name>
      <type>
        <types>EnumRef.ТипыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>Ограничение</name>
      <type>
        <types>CatalogRef.ОграниченияДействийМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриРасчетеЦены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеТребуетОтметкиВыполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МедицинскиеПротивопоказания</name>
    <attributes>
      <name>Противопоказание</name>
      <type>
        <types>CatalogRef.МедицинскиеПротивопоказания</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМедосмотра</name>
      <type>
        <types>EnumRef.ТипыМедосмотров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыВредныхВеществ</name>
    <attributes>
      <name>ГруппаВредныхВеществ</name>
      <type>
        <types>EnumRef.ГруппыОпасныхВеществ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ДействияМедосмотра/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Табличный документ списка действий медосмотра, которым не прописана Номенклатура клиники.
// 
// Возвращаемое значение:
//  Структура - печатная форма.
//
Функция СтруктураПечатиДействийМОБезНоменклатуры_29н(Приказ) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ОбластьШапкаНомер	 = ТабДокумент.Область(1,1);
	ОбластьШапкаДействие = ТабДокумент.Область(1,2);
	
	ОбластьШапкаНомер.Текст		= "№";
	ОбластьШапкаДействие.Текст	= "Список действий медосмотра без номенклатуры:";
	
	ОбластьШапкаНомер.ЦветФона		 = ЦветаСтиля.ЦветФонаШапкиОтчета;
	ОбластьШапкаДействие.ЦветФона	 = ЦветаСтиля.ЦветФонаШапкиОтчета;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	ОбластьШапкаНомер.Обвести(Линия,Линия,Линия,Линия);
	ОбластьШапкаДействие.Обвести(Линия,Линия,Линия,Линия);
	
	ТабДокумент.Область(1,1,1,2).Шрифт = Новый Шрифт(ТабДокумент.Область(1,1,1,2).Шрифт,,10,Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДействияМедосмотра.Наименование КАК НаименованиеПолное,
		|	ДействияМедосмотра.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПереченьВредныхФакторовИРабот.ЛабораторныеИФункциональныеИсследования КАК ПереченьВредныхФакторовИРаботЛабораторныеИФункциональныеИсследования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДействияМедосмотра КАК ДействияМедосмотра
		|		ПО ПереченьВредныхФакторовИРаботЛабораторныеИФункциональныеИсследования.Исследование = ДействияМедосмотра.Ссылка
		|ГДЕ
		|	ДействияМедосмотра.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И ПереченьВредныхФакторовИРаботЛабораторныеИФункциональныеИсследования.Ссылка.НомерПП <> """"
		|	И ПереченьВредныхФакторовИРаботЛабораторныеИФункциональныеИсследования.Ссылка.Приказ = &Приказ";
	
	Запрос.УстановитьПараметр("Приказ", Приказ); 
	
	ДействияМО = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ДействиеМО Из ДействияМО Цикл
		
		НомерСтроки = ДействияМО.Индекс(ДействиеМО)+2;
		
		ОбластьСтрокиДействия = ТабДокумент.ПолучитьОбласть(НомерСтроки,1,НомерСтроки,2);
		
		ОбластьНомер	= ОбластьСтрокиДействия.Область(1,1);
		ОбластьДействие = ОбластьСтрокиДействия.Область(1,2);
		
		ОбластьНомер.Текст		= НомерСтроки - 1;
		ОбластьДействие.Текст	= ДействиеМО.НаименованиеПолное;
		ОбластьДействие.Расшифровка = ДействиеМО.Ссылка;
		
		ОбластьНомер.Обвести(Линия,Линия,Линия,Линия);
		ОбластьДействие.Обвести(Линия,Линия,Линия,Линия);
		
		ТабДокумент.Вывести(ОбластьСтрокиДействия);
	КонецЦикла;
	
	ТабДокумент.Область("C1").ШиринаКолонки = 6;
	ТабДокумент.Область("C2").ШиринаКолонки = 110;
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.Защита = Истина;
	
	СтруктураНаПечать = Новый Структура;
	
	ОписаниеПечатнойФормы = Новый Структура;
	ОписаниеПечатнойФормы.Вставить("СинонимМакета", "Список действий медосмотров в 29н без номенклатуры");
	ОписаниеПечатнойФормы.Вставить("Экземпляров",	1);
	ОписаниеПечатнойФормы.Вставить("ИмяМакета", "СписокДействияМОБезНоменклатуры_29н");
	ОписаниеПечатнойФормы.Вставить("ПолныйПутьКМакету", "");
	ОписаниеПечатнойФормы.Вставить("ИмяФайлаПечатнойФормы", "");
	ОписаниеПечатнойФормы.Вставить("ТабличныйДокумент", ТабДокумент);
	
	КоллекцияПечатныхФорм = Новый Массив; 
	КоллекцияПечатныхФорм.Добавить(ОписаниеПечатнойФормы);
	СтруктураНаПечать.Вставить("КоллекцияПечатныхФорм",КоллекцияПечатныхФорм);
	
	Возврат СтруктураНаПечать;
	
КонецФункции

#КонецОбласти
